trunk/GlassfishESBExample/DemoCA/src/jbiasa/DemoCA.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="DemoCA"
             xmlns:tns="DemoCA" xmlns:ns="http://esb.javaitzen/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://esb.javaitzen/" location="../jbiServiceUnits/DemoBpel/DemoESBService.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:DemoESB">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="mainESBEntry">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding2" type="ns:DemoESB">
        <operation name="mainESBEntry">
            <input/>
            <output/>
        </operation>
    </binding>
    <service name="DemoCAService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/DemoCAService1/casaPort1"/>
        </port>
    </service>
    <service name="DemoCAService2">
        <port name="casaPort2" binding="tns:casaBinding2"/>
    </service>
</definitions>

